In [2]:
def foo(): pass
f = foo()
print(f)

None

In [3]:
type(f)

NoneType

In [4]:
None + 2

TypeError: unsupported operand type(s) for +: 'NoneType' and 'int'

In [5]:
import numpy as np
np.nan + 2

nan

In [6]:
type(np.nan)

float

In [7]:
import pandas as pd
s = pd.Series([1, 2, None, np.nan])
s

0    1.0
1    2.0
2    NaN
3    NaN
dtype: float64

In [8]:
s.sum()

3.0

In [9]:
s.isna()

0    False
1    False
2     True
3     True
dtype: bool

In [10]:
df = pd.DataFrame({"one": [1, 2, np.nan],
                  "two": [np.nan, 3, 4]})
df.isna()

     one    two
0  False   True
1  False  False
2   True  False

# 项目案例

In [11]:
hitters = pd.read_csv("./data/Hitters.csv")
hitters.isna().any()

AtBat        False
Hits         False
HmRun        False
Runs         False
RBI          False
Walks        False
Years        False
CAtBat       False
CHits        False
CHmRun       False
CRuns        False
CRBI         False
CWalks       False
League       False
Division     False
PutOuts      False
Assists      False
Errors       False
Salary        True
NewLeague    False
dtype: bool

In [12]:
(hitters.shape[0] - hitters.count()) / hitters.shape[0]

AtBat        0.00000
Hits         0.00000
HmRun        0.00000
Runs         0.00000
RBI          0.00000
Walks        0.00000
Years        0.00000
CAtBat       0.00000
CHits        0.00000
CHmRun       0.00000
CRuns        0.00000
CRBI         0.00000
CWalks       0.00000
League       0.00000
Division     0.00000
PutOuts      0.00000
Assists      0.00000
Errors       0.00000
Salary       0.18323
NewLeague    0.00000
dtype: float64

In [13]:
(df.shape[1] - df.T.count()) / df.shape[1]

0    0.5
1    0.0
2    0.5
dtype: float64

In [14]:
df.dropna()

   one  two
1  2.0  3.0

In [15]:
df.dropna?

In [16]:
df = pd.concat([df, pd.DataFrame({"one": [np.nan],
                                 "two": [np.nan],
                                 "three": [np.nan]})],
              ignore_index=True,
              sort=False)
df

   one  two  three
0  1.0  NaN    NaN
1  2.0  3.0    NaN
2  NaN  4.0    NaN
3  NaN  NaN    NaN

In [17]:
df.dropna(axis=0, how='all')

   one  two  three
0  1.0  NaN    NaN
1  2.0  3.0    NaN
2  NaN  4.0    NaN

In [18]:
df.dropna(thresh=2)

   one  two  three
1  2.0  3.0    NaN

In [19]:
hitters_nona = hitters.dropna()
hitters_nona.isna().any()

AtBat        False
Hits         False
HmRun        False
Runs         False
RBI          False
Walks        False
Years        False
CAtBat       False
CHits        False
CHmRun       False
CRuns        False
CRBI         False
CWalks       False
League       False
Division     False
PutOuts      False
Assists      False
Errors       False
Salary       False
NewLeague    False
dtype: bool

In [20]:
hitters_nona.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 263 entries, 1 to 321
Data columns (total 20 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   AtBat      263 non-null    int64
 1   Hits       263 non-null    int64
 2   HmRun      263 non-null    int64
 3   Runs       263 non-null    int64
 4   RBI        263 non-null    int64
 5   Walks      263 non-null    int64
 6   Years      263 non-null    int64
 7   CAtBat     263 non-null    int64
 8   CHits      263 non-null    int64
 9   CHmRun     263 non-null    int64
 10  CRuns      263 non-null    int64
 11  CRBI       263 non-null    int64
 12  CWalks     263 non-null    int64
 13  League     263 non-null    object
 14  Division   263 non-null    object
 15  PutOuts    263 non-null    int64
 16  Assists    263 non-null    int64
 17  Errors     263 non-null    int64
 18  Salary     263 non-null    float64
 19  NewLeague  263 non-null    object
dtypes: float64(1), int64(16), object(3)
memory usage: 43.1+ KB

# 动手练习

In [21]:
elements = pd.read_csv("./data/elements.csv")
elements.isna().any()

atomic number               False
symbol                      False
name                        False
atomic mass                 False
CPK                         False
electronic configuration    False
electronegativity            True
atomic radius                True
ion radius                   True
van der Waals radius         True
IE-1                         True
EA                           True
standard state               True
bonding type                 True
melting point                True
boiling point                True
density                      True
metal                       False
year discovered             False
group                       False
period                      False
dtype: bool

In [23]:
(elements.shape[0] - elements.count()) / elements.shape[0]

atomic number               0.000000
symbol                      0.000000
name                        0.000000
atomic mass                 0.000000
CPK                         0.000000
electronic configuration    0.000000
electronegativity           0.177966
atomic radius               0.398305
ion radius                  0.220339
van der Waals radius        0.677966
IE-1                        0.135593
EA                          0.279661
standard state              0.161017
bonding type                0.169492
melting point               0.144068
boiling point               0.203390
density                     0.186441
metal                       0.000000
year discovered             0.000000
group                       0.000000
period                      0.000000
dtype: float64

In [24]:
(elements.shape[1] - elements.T.count()) / elements.shape[1]

0      0.047619
1      0.142857
2      0.000000
3      0.047619
4      0.047619
         ...
113    0.523810
114    0.523810
115    0.523810
116    0.523810
117    0.523810
Length: 118, dtype: float64

In [25]:
elements_nona = elements.dropna()
elements_nona.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 31 entries, 2 to 81
Data columns (total 21 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   atomic number             31 non-null     int64
 1   symbol                    31 non-null     object
 2   name                      31 non-null     object
 3   atomic mass               31 non-null     object
 4   CPK                       31 non-null     object
 5   electronic configuration  31 non-null     object
 6   electronegativity         31 non-null     float64
 7   atomic radius             31 non-null     float64
 8   ion radius                31 non-null     object
 9   van der Waals radius      31 non-null     float64
 10  IE-1                      31 non-null     float64
 11  EA                        31 non-null     float64
 12  standard state            31 non-null     object
 13  bonding type              31 non-null     object
 14  melting point             31 non-null     float64
 15  boiling point             31 non-null     float64
 16  density                   31 non-null     float64
 17  metal                     31 non-null     object
 18  year discovered           31 non-null     object
 19  group                     31 non-null     object
 20  period                    31 non-null     int64
dtypes: float64(8), int64(2), object(11)
memory usage: 5.3+ KB

In [26]:
elements_nona.isna().any()

atomic number               False
symbol                      False
name                        False
atomic mass                 False
CPK                         False
electronic configuration    False
electronegativity           False
atomic radius               False
ion radius                  False
van der Waals radius        False
IE-1                        False
EA                          False
standard state              False
bonding type                False
melting point               False
boiling point               False
density                     False
metal                       False
year discovered             False
group                       False
period                      False
dtype: bool

In [27]:
elements_nona.head()

,atomic number,symbol,name,atomic mass,CPK,electronic configuration,electronegativity,atomic radius,ion radius,van der Waals radius,...,EA,standard state,bonding type,melting point,boiling point,density,metal,year discovered,group,period
2,3,Li,Lithium,6.941,#CC80FF,[He] 2s1,0.98,134.0,76 (+1),182.0,...,-60.0,solid,metallic,454.0,1615.0,0.54,alkali metal,1817,1,2
5,6,C,Carbon,12.0107,#909090,[He] 2s2 2p2,2.55,77.0,16 (+4),170.0,...,-154.0,solid,covalent network,3823.0,4300.0,2.26,nonmetal,Ancient,14,2
6,7,N,Nitrogen,14.0067,#3050F8,[He] 2s2 2p3,3.04,75.0,146 (-3),155.0,...,-7.0,gas,diatomic,63.0,77.0,0.00,nonmetal,1772,15,2
7,8,O,Oxygen,15.9994,#FF0D0D,[He] 2s2 2p4,3.44,73.0,140 (-2),152.0,...,-141.0,gas,diatomic,55.0,90.0,0.00,nonmetal,1774,16,2
8,9,F,Fluorine,18.9984032,#90E050,[He] 2s2 2p5,3.98,71.0,133 (-1),147.0,...,-328.0,gas,atomic,54.0,85.0,0.00,halogen,1670,17,2

In [28]:
elements_nona.shape

(31, 21)

# 拓展研究

* 检查数据库表的记录中是否存在缺失值

SELECT LastName,FirstName,Address FROM Persons WHERE Address IS NULL

SELECT LastName,FirstName,Address FROM Persons WHERE Address IS NOT NULL

* 将缺失值所在记录删除

DELETE FROM Person WHERE LastName IS NULL